Revit 2026 API

# ViewNodeGetCameraInfo Method

---

Information about the observation point (the camera) of the view.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public CameraInfo GetCameraInfo()
```
```vb
Public Function GetCameraInfo As CameraInfo
```
```cpp
public:
CameraInfo^ GetCameraInfo()
```
```fsharp
member GetCameraInfo : unit -> CameraInfo
```

#### Return Value

CameraInfo An instance of CameraInfo or  if there is no info associated with the view

#### Reference

ViewNode Class

Autodesk.Revit.DB Namespace